#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=39efng]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function has been changed
  ~ resource "aws_cloudwatch_log_group" "get_revenue_sum_by_company_lambda_function" {
        id                = "/aws/lambda/demo_get_revenue_sum_by_company_lambda_function"
        name              = "/aws/lambda/demo_get_revenue_sum_by_company_lambda_function"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "a805a30455c9dd01575c28c93b379439" -> "6c5b80f85cd18c0ee0bcab36396f8359"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "51407f2a401c3021d1cd90384f37dbbe" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_average_metrics_handler.zip" -> null
      - key                = "lambdas/demo/get_average_metrics_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_average_metrics_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "6f4dabe1ac50d2321d290fe0ee498565" -> "c29fac61629bfb972d0a0dfa5f0aaf79"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "2f8c17566f0df35ecbc9e284726014c6" -> "7ad7b673879d7bc3460d8306ff12e80e"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "4cdba2e645752b7943a3d5b437500b69" -> "9d66c5737c0f239e32f1db86e2e59fe5"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "63c7b3d5c6e7a6e5b00a2e6cabfc1b92" -> "0c1319cbdb450d29f450489cee74088c"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "9281b5a19d193e9a93d3373fbc18b87e" -> "b899651f114414605cf438390915d53c"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "005c90b13148ac626d91de2e877e3559" -> "0ebc7d0912a7f3b496d0ff721b29530b"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "c283a0cb32a49ba2ded1a562bc369f51" -> "12b68d90df79e58b544bedf9a9aba35f"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "cbe8cc7aa4b429a53f5c84664a00f54c" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip" -> null
      - key                = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_revenue_sum_by_cohort_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "f54a81abf2edfe83ac453e37a9991f46" -> "d1dd5b73f66d0d6bcb2abab624e1d9ac"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a29c0ffc1be186e6939a977ec10bc7f9" -> "34d1ce171cae8f4bd6d44685835667a7"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "29ceae1f950816bfd2cd953744c1d13c" -> "6816b628a974bab0687e3cce3ea28c16"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "990a66d06466bcf8f8a6f431ea6a516f" -> "7bb873d308f8b093f50e28d0dec6c89d"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2021-11-22T22:07:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZDHuL0xCTm+WTXpTg7+6+cF6jEG6PTU4CX57ftODAq4=" -> "aMql7ZYcp6LCaZgWFPrL0Ehpgn8AKwe09sdbsa7Bd4c="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be destroyed
  - resource "aws_lambda_function" "get_average_metrics_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_average_metrics_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_average_metrics_lambda_function" -> null
      - handler                        = "get_average_metrics_handler.handler" -> null
      - id                             = "demo_get_average_metrics_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_average_metrics_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-11-22T22:06:27.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_average_metrics_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_average_metrics_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_average_metrics_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "j2cRTDuKqyX+BYpZbaFDw5sVNypa2laoDbowxBsqITc=" -> null
      - source_code_size               = 3853 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "MB8A60AEWjtUWELdeVOnxZu2zu/p+V5BJ0cMUHSmQrs=" -> "mH7X0/iGUv3zBoWoZeeJZOipy/dB8V+zy9g2jtQk14E="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "7FUxfe0aEcF8+79F5VJie3KM2tH7CXrNm52deT7dIbA=" -> "9aaqCOWtnU5aCoYYqCKtK8XqmFKxPjAbRvTNPuyncAM="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "zFJVXo9eHh4VD1Oz8n6/oOurnmWFN247L+Qy7kB9woQ=" -> "DLyb35YnRodF/qDURYshddVBSF7RA2IoABvGfAY3MQI="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "BigfFQOskJmnQfYe+d1+dQ0ECjjLobPL6zGjt6I7khg=" -> "kyeoUJuORk6XrFiscB27X0OjJns6uU0rMCRMjCY3HR4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "U99ZqZpn2tf23kVGLQdgl0O8vFcBtsPCSq8+pquOilI=" -> "ZJBzwsKo2NZAbcbXl2rAIho85LMnTucoeusZfs3zYwY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "Wo5CoX8A4Ab7ijNoQ8IgVpviii6u4aCepCbcpt0RZj8=" -> "lOgmsvTha0Hvzj2xlwhWjwFwaRn2B0QMl0UyB1Sq4t8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUMoNFP5aPA4UWZ2qajEx0d9uVsG9DhsV/KQ4YofEBI=" -> "oje9h6442AssEWFlQZbmeKYILVZAA4+zhz8w2OIY94M="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - handler                        = "get_revenue_sum_by_cohort_handler.handler" -> null
      - id                             = "demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_sum_by_cohort_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-11-22T22:06:27.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_sum_by_cohort_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "3wu3lhhYMUcyqKHezzcnJu0E2h79q3a5PVgUHGwdoH0=" -> null
      - source_code_size               = 4221 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2021-11-22T22:06:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "DVcBKimoTvdOQSVBxHiYRPj1+Xw9mdrI+5D3ZwUgGs0=" -> "MWUB8MBw6xniAp2RibT/sp5oO5oeGnb1fcryI6IK+dQ="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2021-11-22T22:07:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "d01ewUmdDFRE3tO5/vlFJOBqtPbazVtqS2a3IWGcOLc=" -> "esc3++vJEq92JynqAjMPxlwpeuEOlz4bbYQBtvTwmIw="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2021-11-22T22:07:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TuLnhx9e7UBD295EW/Z0VbuUX+DqPe0aEbfQHyT3uk0=" -> "/SBQNxjIn0lxKoDDcBBAnNUBAoQ+FIzQL2qfAXszmaA="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-11-22T22:06:25Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "39efng" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2021-11-22T22:06:23Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_average_metrics_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_average_metrics_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_average_metrics_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_average_metrics_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_revenue_sum_by_cohort_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function will be destroyed
  - resource "aws_cloudwatch_log_group" "get_revenue_sum_by_company_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_revenue_sum_by_company_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_revenue_sum_by_company_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_revenue_sum_by_company_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.network.aws_api_gateway_integration.average_metrics_integration will be destroyed
  - resource "aws_api_gateway_integration" "average_metrics_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "ww2zcl" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-ww2zcl-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "ww2zcl" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_average_metrics_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration will be destroyed
  - resource "aws_api_gateway_integration" "revenue_sum_by_cohort_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "pymy9y" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-pymy9y-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "pymy9y" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_revenue_sum_by_cohort_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_method.get_average_metrics_method will be destroyed
  - resource "aws_api_gateway_method" "get_average_metrics_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-ww2zcl-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.name" = true
        } -> null
      - resource_id          = "ww2zcl" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_metric_by_company_id_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_metric_by_company_id_method" {
        id                   = "agm-kb7gblbu69-k9hbzo-GET"
      ~ request_parameters   = {
          + "method.request.querystring.name"          = false
          + "method.request.querystring.scenario_type" = false
        }
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method will be destroyed
  - resource "aws_api_gateway_method" "get_revenue_sum_by_cohort_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-pymy9y-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "pymy9y" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.average_metrics will be destroyed
  - resource "aws_api_gateway_resource" "average_metrics" {
      - id          = "ww2zcl" -> null
      - parent_id   = "k9hbzo" -> null
      - path        = "/metrics/{company_id}/avg" -> null
      - path_part   = "avg" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.cohort_revenue will be destroyed
  - resource "aws_api_gateway_resource" "cohort_revenue" {
      - id          = "pymy9y" -> null
      - parent_id   = "97prpe" -> null
      - path        = "/cohorts/cohort-revenue" -> null
      - path_part   = "cohort-revenue" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.policy.aws_iam_role.get_average_metrics_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "get_average_metrics_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_get_average_metrics_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-11-22T22:00:39Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_get_average_metrics_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_get_average_metrics_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHT4APOQDHU" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role will be destroyed
  - resource "aws_iam_role" "get_revenue_sum_by_cohort_lambda_exec_role" {
      - arn                   = "arn:aws:iam::435552912911:role/demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-11-22T22:00:39Z" -> null
      - description           = "Allows Lambda Function to call AWS services on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
          - "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWK2H2AYHUH2Q5WHXZ" -> null

      - inline_policy {}
    }

  # module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_average_metrics_lambda_logs" {
      - id         = "demo_get_average_metrics_lambda_exec_role-20211122220041624400000004" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_get_average_metrics_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_average_metrics_lambda_vpc" {
      - id         = "demo_get_average_metrics_lambda_exec_role-20211122220041443600000003" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_get_average_metrics_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_revenue_sum_by_cohort_lambda_logs" {
      - id         = "demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function" -> null
      - role       = "demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
    }

  # module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc will be destroyed
  - resource "aws_iam_role_policy_attachment" "get_revenue_sum_by_cohort_lambda_vpc" {
      - id         = "demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002" -> null
      - policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function" -> null
      - role       = "demo_get_revenue_sum_by_cohort_lambda_exec_role" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_average_metrics_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_average_metrics_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayAverage" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayAverage" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_revenue_sum_by_cohort_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_revenue_sum_by_cohort_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayRevenueSum" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayRevenueSum" -> null
    }

Plan: 1 to add, 24 to change, 22 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*